``` Terraform will perform the following actions:

  # aws_route53_record.upload-galaxyproject will be created
  + resource "aws_route53_record" "upload-galaxyproject" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "upload.galaxyproject.eu"
      + records         = (known after apply)
      + ttl             = 600
      + type            = "A"
      + zone_id         = "Z386N8B8JBC6TQ"
    }

  # openstack_compute_instance_v2.upload will be created
  + resource "openstack_compute_instance_v2" "upload" {
      + access_ip_v4        = (known after apply)
      + access_ip_v6        = (known after apply)
      + all_metadata        = (known after apply)
      + all_tags            = (known after apply)
      + availability_zone   = (known after apply)
      + flavor_id           = (known after apply)
      + flavor_name         = "m1.medium"
      + force_delete        = false
      + id                  = (known after apply)
      + image_id            = "5a31b410-4f09-4b6c-84eb-eb16ca237f0a"
      + image_name          = (known after apply)
      + key_pair            = "cloud2"
      + name                = "upload.galaxyproject.eu"
      + power_state         = "active"
      + region              = (known after apply)
      + security_groups     = [
          + "default",
          + "public-ssh",
          + "public-web2",
          + "ufr-ingress",
        ]
      + stop_before_destroy = false
      + user_data           = "f1afc818d33a9c6c68d6c2dd4401f2e9abd7f8fc"

      + network {
          + access_network = false
          + fixed_ip_v4    = (known after apply)
          + fixed_ip_v6    = (known after apply)
          + floating_ip    = (known after apply)
          + mac            = (known after apply)
          + name           = "bioinf"
          + port           = (known after apply)
          + uuid           = (known after apply)
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + upload-node_name         = "upload.galaxyproject.eu"
  + upload-node_public-ip-v4 = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tf.plan

To perform exactly these actions, run the following command to apply:
    terraform apply "tf.plan" ```